flowOverCylinder2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     IBMFoam;
//startFrom       latestTime;
startFrom       startTime;
startTime       0;
stopAt          endTime;
//stopAt          writeNow;
endTime         1;
deltaT          0.0005;
writeControl    adjustableRunTime;//runTime;//timeStep;
writeInterval   0.1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
adjustTimeStep	yes;
maxCo		0.05;
maxDeltaT	0.1;

functions
{
    #includeFunc residuals
}
//libs ("libparabolicVelocity.so");
// ************************************************************************* //
